Project/Toir/src/InformationRegisters/гкс_ИдентификаторыСинхронизируемыхОбъектов/гкс_ИдентификаторыСинхронизируемыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ИдентификаторыСинхронизируемыхОбъектов</name>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приложение</name>
    <type>
      <types>CatalogRef.гкс_УчастникиОбменаRMQ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/CommonModules/гкс_ИнтеграцияXDTOАдаптер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// гкс_ИнтеграцияXDTOАдаптер
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Функция ПолучитьСсылкуПоObjectID
//
// Описание: Поиск ссылки по гуид внешнего объекта.
//
// Параметры
//  objectId - ОбъектXDTO - ОбъетXDTO, по которому происходит поиск ссылки 
//
// Возвращаемое значение: 
//	Неопределено если ссылка не найдена
//	Ссылка - Ссылка на найденный объект 
//              
// Гкс+[CPM30-1106] Селимов от 09.07.2020. Добавлено:{
Функция ПолучитьСсылкуПоObjectID(objectId) Экспорт
	
	Если objectId = Неопределено ИЛИ ПустаяСтрока(objectId.type) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяТипа = гкс_ИнтеграцияXDTOАдаптерПовтИсп.ПолучитьПолноеИмяИзXDTO(objectId.type);
	
	Ссылка = Неопределено;
	
	Если ПустаяСтрока(objectId.id) Тогда 
		Ссылка = ПредопределенноеЗначение(ИмяТипа + ".ПустаяСсылка");
	Иначе
		Если Найти(НРег(ИмяТипа), "перечисление.") > 0 Тогда
			Ссылка = ПредопределенноеЗначение(ИмяТипа + "." + objectId.id);
		Иначе
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяТипа);
			Ссылка = МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(objectId.id));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции 

// Функция ТипОбъекта
//
// Описание: Получение типа XDTO по имени и URI пространства имен.
//
// Параметры 
//  ИмяТипаОбъекта - Строка - Имя запрашиваемого типа.
//
// Возвращаемое значение: 
//	ТипЗначенияXDTO, ТипОбъектаXDTO, Неопределено.
//              
Функция ТипОбъекта(ИмяТипаОбъекта) Экспорт
	Возврат ФабрикаXDTO.Тип("http://sodru.com/AsynxExchangeServices", ИмяТипаОбъекта);
КонецФункции 

// Функция ЗаполнитьРеквизитИзСвойстваXDTO
//
// Описание: Сформировывает Объект XDTO ошибку и производит запись в журнал регистрации.
//
// Параметры 
//  Реквизит - Реквизит - заполняемый реквизит. 
//  ОбъектXDTO - ОбъектXDTO - ОбъектXDTO, из которого подбирается значение реквизита.
//  ИмяСвойстваXDTO - Строка - ИмяСвойстваXDTO из которого заполняется значение
//  СообщениеОПустомЗначении - Строка - СообщениеОПустомЗначении
//              
Процедура ЗаполнитьРеквизитИзСвойстваXDTO(Реквизит, ОбъектXDTO, ИмяСвойстваXDTO, СообщениеОПустомЗначении = "") Экспорт
	
	Если ОбъектXDTO.Установлено(ИмяСвойстваXDTO) Тогда 
		Реквизит = ПолучитьЗначениеИзXDTO(ОбъектXDTO[ИмяСвойстваXDTO]);
		Если Не ПустаяСтрока(СообщениеОПустомЗначении) И Не ЗначениеЗаполнено(Реквизит) Тогда
			ВызватьИсключение СообщениеОПустомЗначении;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция ПолучитьЗначениеИзXDTO
//
// Описание: Поиск ссылки на объект текущей ИБ по внешнему объекту XDTO.
//
// Параметры 
//  ЗначениеПараметраXDTO - ОбъектXDTO - значение реквизита, либо внешний объект xdto по которому получают ссылку.
//
// Возвращаемое значение: 
//	ЛюбаяСсылка - Найденная ссылка текущей ИБ или Неопределено если объект не найден.
//              
Функция ПолучитьЗначениеИзXDTO(ЗначениеПараметраXDTO) Экспорт
	
	Результат = Неопределено;
	
	Если ТипЗнч(ЗначениеПараметраXDTO) = Тип("ОбъектXDTO") Тогда
		
		ТипОбъектаXDTO = ЗначениеПараметраXDTO.Тип();
		
		Если ТипОбъекта("ASObject").ЭтоПотомок(ТипОбъектаXDTO) Тогда
			
			Реквизит = ПолучитьСсылкуПоObjectID(ЗначениеПараметраXDTO.objectId);
			
			Если Не ОбщегоНазначения.СсылкаСуществует(Реквизит) Тогда
				Приложение = гкс_ИнтеграцияXDTOАдаптерПовтИсп.ПолучитьПриложениеПоИмени("zup");
				СсылкаПоИД = ПолучитьСсылкуПоИДСинхронизируемогоОбъекта(ЗначениеПараметраXDTO.objectId, Приложение);	
				Если СсылкаПоИД = Неопределено Тогда 
					Если ТипОбъекта("ASJobTitle") = ТипОбъектаXDTO Тогда
						РеквизитСсылка = ПолучитьДолжностьПоНаименованию(ЗначениеПараметраXDTO, Приложение);
					ИначеЕсли ТипОбъекта("ASCostCenter") = ТипОбъектаXDTO Тогда 
						РеквизитСсылка = ПолучитьПодразделениеПоНаименованию(ЗначениеПараметраXDTO, Приложение);
					ИначеЕсли ТипОбъекта("ASCompany") = ТипОбъектаXDTO Тогда
						РеквизитСсылка = ПолучитьОрганизациюПоИНН(ЗначениеПараметраXDTO, Приложение);	
					КонецЕсли;
					Если РеквизитСсылка = Неопределено Тогда
						Возврат РеквизитСсылка;
					Иначе						
						Реквизит = РеквизитСсылка;
					КонецЕсли; 
				Иначе					
					Реквизит = СсылкаПоИД;	
				КонецЕсли;
			КонецЕсли;			
			
		ИначеЕсли ТипОбъектаXDTO = ТипОбъекта("ASObjectID") Тогда
			Реквизит = ПолучитьСсылкуПоObjectID(ЗначениеПараметраXDTO);
		Иначе
			Реквизит = СериализаторXDTO.ПрочитатьXDTO(ЗначениеПараметраXDTO);
		КонецЕсли;
		
	Иначе
		
		Реквизит = ЗначениеПараметраXDTO;
		
	КонецЕсли;
	
	Возврат Реквизит;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСсылкуПоИДСинхронизируемогоОбъекта(objectId, Приложение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.гкс_ИдентификаторыСинхронизируемыхОбъектов КАК Таблица
		|ГДЕ
		|	Таблица.Приложение = &Приложение
		|	И Таблица.Идентификатор = &УИД";
	
	Запрос.УстановитьПараметр("Приложение", Приложение);
	Запрос.УстановитьПараметр("УИД", objectId.id);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьДолжностьПоНаименованию(ДолжностьXDTO, Приложение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Должности.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Должности КАК Должности
		|ГДЕ
		|	Должности.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ДолжностьXDTO.name);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли; 
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ОбщегоНазначения.СсылкаСуществует(ВыборкаДетальныеЗаписи.Ссылка) Тогда
	
		ДобавитьЗаписьВИдентификаторСинхОбъектов(Приложение, ВыборкаДетальныеЗаписи.Ссылка, ДолжностьXDTO.objectId.id);
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЕсли; 	
	
КонецФункции
                        
Функция ПолучитьПодразделениеПоНаименованию(ПодразделениеXDTO, Приложение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтруктураПредприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Наименование = &Наименование
		|";
	
	Запрос.УстановитьПараметр("Наименование", ПодразделениеXDTO.name);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли; 

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	Если ОбщегоНазначения.СсылкаСуществует(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		ДобавитьЗаписьВИдентификаторСинхОбъектов(Приложение, ВыборкаДетальныеЗаписи.Ссылка, ПодразделениеXDTO.objectId.id);
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЕсли; 	
		
КонецФункции

Функция ПолучитьОрганизациюПоИНН(ЗначениеПараметраXDTO, Приложение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ИНН = &ИНН
		|";
	
	Запрос.УстановитьПараметр("ИНН", ЗначениеПараметраXDTO.CodeInn);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли; 

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	Если ОбщегоНазначения.СсылкаСуществует(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		ДобавитьЗаписьВИдентификаторСинхОбъектов(Приложение, ВыборкаДетальныеЗаписи.Ссылка, ЗначениеПараметраXDTO.objectId.id);
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЕсли; 	
	
КонецФункции

Процедура ДобавитьЗаписьВИдентификаторСинхОбъектов(Приложение, Ссылка, Идентификатор)
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Приложение", Приложение);
	СтруктураЗаписи.Вставить("Ссылка", Ссылка);		
	СтруктураЗаписи.Вставить("Идентификатор", Идентификатор);

	РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектов.ДобавитьЗапись(СтруктураЗаписи, Истина);
		
КонецПроцедуры

#КонецОбласти
